#include <stdio.h>
void main(){
int i,j;
int k = 0;//缺页中断次数
char cc[21]; //记录是否进行缺页，缺页则为Y，否则为N 
int a[20] = {1,2,3,4,5,6,3,5,6,2,1,2,5,1,2,4,5,3,4,5}; //页面调度顺序
int b[4][21];
int c[21];//记录页面淘汰顺序 
int p = 0;
b[0][0] = 0; //C 语言定义数组，其初值是不确定的
 b[1][0] = 0;
 b[2][0] = 0;
 b[3][0] = 0;
 
 printf("      ");//调整界面美观性 
 for(i = 0;i < 20;i++)
 printf("%6d",a[i]);//打印出页面调度顺序
 printf("\n      ============================================================================\n");
 for(i = 0;i < 20;i++){
 if(a[i]==b[0][i]||a[i]==b[1][i]||a[i]==b[2][i]||a[i]==b[3][i]){//如果当前需要调度页面已在进程页中 
 b[0][i+1]=b[0][i];//依次将每行当前状态向后复制一行 
 b[1][i+1]=b[1][i];
 b[2][i+1]=b[2][i];
  b[3][i+1]=b[3][i];
 cc[i]='N';//由于在当前页中，所以不用缺页中断 
 }
 else{//如果当前需要调度页面不在进程页中，则需要进行调度 
 if(i > 3){//i>3才会进行中断，在此之前有空余页 
 c[p]=b[3][i];//记录需要调出的页面 
 p++;
 }
 b[0][i+1]=a[i];
 b[1][i+1]=b[0][i];
 b[2][i+1]=b[1][i];
  b[3][i+1]=b[2][i];
 cc[i]='Y';
 k=k+1;
 }
 }
 
 
 //依次打印出界面顺序情况 
 for(j=0;j<21;j++)
 printf("%6d",b[0][j]);
 printf("\n      -----------------------------------------------------------------------------------------------------------\n");
for(j=0;j<21;j++)
 printf("%6d",b[1][j]);
 printf("\n      -----------------------------------------------------------------------------------------------------------\n");
 for(j=0;j<21;j++)
 printf("%6d",b[2][j]);
 printf("\n      -----------------------------------------------------------------------------------------------------------\n");
  for(j=0;j<21;j++)
 printf("%6d",b[3][j]);
 printf("\n      -----------------------------------------------------------------------------------------------------------\n");
 
 //打印出缺页中断情况Y/N 
 printf("      ");//调整界面美观性 
 for(j=0;j<21;j++){
 printf("     ");//调整界面美观性 
 putchar(cc[j]); //打印出缺页中断情况Y/N 
 }
 
 
 printf("\n 缺页中断次数：%3d\n",k);
 printf("页面淘汰顺序：");
 for(j=0;j<p;j++)
 printf("%3d",c[j]);
 printf("\n\n");
 }
